In [1]:
import pandas as pd

In [14]:
df1 = pd.read_csv('ts2')

In [15]:
df1.count()

Unnamed: 0    1160193
3             1160193
8             1160182
dtype: int64

In [16]:
df1.head()

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>Unnamed: 0</th>
      <th>3</th>
      <th>8</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>0</td>
      <td>[01/Jun/1995:00:00:59</td>
      <td>271</td>
    </tr>
    <tr>
      <th>1</th>
      <td>1</td>
      <td>[01/Jun/1995:00:02:51</td>
      <td>205908</td>
    </tr>
    <tr>
      <th>2</th>
      <td>2</td>
      <td>[01/Jun/1995:00:05:44</td>
      <td>271</td>
    </tr>
    <tr>
      <th>3</th>
      <td>3</td>
      <td>[01/Jun/1995:00:08:06</td>
      <td>1116</td>
    </tr>
    <tr>
      <th>4</th>
      <td>4</td>
      <td>[01/Jun/1995:00:08:19</td>
      <td>49649</td>
    </tr>
  </tbody>
</table>
</div>

In [17]:
df1.rename(columns ={'3':'time','8':'bytes'},inplace=True)

In [18]:
new_df = df1[['time','bytes']].copy()

In [19]:
new_df.to_csv('time_series.csv')

In [20]:
new_df.head()

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>time</th>
      <th>bytes</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>[01/Jun/1995:00:00:59</td>
      <td>271</td>
    </tr>
    <tr>
      <th>1</th>
      <td>[01/Jun/1995:00:02:51</td>
      <td>205908</td>
    </tr>
    <tr>
      <th>2</th>
      <td>[01/Jun/1995:00:05:44</td>
      <td>271</td>
    </tr>
    <tr>
      <th>3</th>
      <td>[01/Jun/1995:00:08:06</td>
      <td>1116</td>
    </tr>
    <tr>
      <th>4</th>
      <td>[01/Jun/1995:00:08:19</td>
      <td>49649</td>
    </tr>
  </tbody>
</table>
</div>